{
    "config": {
        "step": {
            "user": {
                "title": "Añade tu persiana inteligente Tuiss.",
                "description": "Asegúrate de haberte conectado a la aplicación Tuiss antes de usarla para establecer correctamente los valores superior e inferior. La dirección MAC se puede encontrar en la etiqueta que venía adjunta a tu persiana o en una etiqueta impresa en la parte superior de la persiana, cerca de donde está conectada la batería.",
                "data": {
                    "host": "XX:XX:XX:XX:XX:XX",
                    "name": "Nombre amigable para tu persiana."
                }
            },
            "confirm": {
                "title": "Nombra tu persiana inteligente Tuiss.",
                "description": "Añade un nombre amigable para tu persiana.",
                "data": {
                    "name": "Nombre amigable para tu persiana."
                }
            }
        },
        "error": {
            "cannot_connect": "Conexión fallida. Por favor, inténtelo de nuevo.",
            "invalid_auth": "Autenticación fallida. Este error no debería ser posible, si lo obtiene, por favor, informe de un problema.",
            "unknown": "Error desconocido. Por favor, inténtelo de nuevo. Si obtiene este error de forma consistente, por favor, informe de un problema.",
            "device_not_found": "No se pudo encontrar el dispositivo. Asegúrese de que esté encendido y dentro del alcance.",
            "connection_timeout": "La conexión se agotó después de varios reintentos. Por favor, inténtelo de nuevo más tarde.",
            "invalid_host": "Su dirección MAC debe tener el formato XX:XX:XX:XX:XX:XX",
            "invalid_name": "Su nombre debe tener más de 0 caracteres"
        },
        "abort": {
            "already_configured": "[%key:common::config_flow::abort::already_configured_device%]",
            "already_configured_by_discovery": "Este dispositivo ya ha sido descubierto. Por favor, configúrelo a través de la lista de dispositivos descubiertos."
        }
    },
    "options":{
        "step":{
            "init": {
                "title": "Opciones adicionales.",
                "data": {
                    "blind_orientation": "Invertir la respuesta de 'Set_Blind_Position'",
                    "blind_restart_position": "Comprobar la posición de la persiana al reiniciar",
                    "blind_restart_attempts": "Intentos de reconexión",
                    "blind_speed": "A qué velocidad debe moverse la persiana a la posición",
                    "blind_favorite_position": "Posición Favorita"
                },
                "data_description": {
                    "blind_orientation": "Invierte el resultado de la acción 'Set_Blind_Position'. Selecciona esta opción si al usar la acción se devuelve un valor opuesto al que esperarías, p. ej. 60% abierto en lugar de 40% abierto.",
                    "blind_restart_position": "Obtener la posición actual de las persianas después de un reinicio de Home Assistant. Útil si usas la aplicación Smartview o un mando a distancia.",
                    "blind_restart_attempts": "Número de intentos de conexión que se realizarán antes de que se agote el tiempo de espera. Aumenta este valor si observas que se pierden solicitudes. Nota: la distancia entre las persianas y los proxies/dongles de Bluetooth es la causa principal de las caídas de conexión.",
                    "blind_favorite_position": "La posición (en porcentaje, 0=cerrado, 100=abierto) a la que se moverá la persiana cuando se presione el botón 'Ir a la Posición Favorita'."
                }
            }
        },
        "error": {
            "blind_is_moving": "La persiana se está moviendo actualmente. Espere a que se detenga antes de cambiar la velocidad."
        }
    }
,
    "services": {
        "get_battery_status": {
            "name": "Obtener estado de la batería",
            "description": "Obtiene el estado de la batería para las persianas Tuiss seleccionadas"
        },
        "get_blind_position": {
            "name": "Obtener posición de la persiana",
            "description": "Obtiene la posición actual de la persiana para las persianas Tuiss seleccionadas"
        },
        "set_blind_position": {
            "name": "Establecer posición de la persiana",
            "description": "Establece la posición de la persiana con una precisión de un solo punto decimal (0.0-100.0)",
            "fields": {
                "position": {
                    "name": "Posición",
                    "description": "Posición objetivo entre 0.0 (cerrado) y 100.0 (abierto) con una precisión de 1 punto decimal)"
                }
            }
        },
        "set_blind_speed": {
            "name": "Establecer velocidad de la persiana",
            "description": "Establece la velocidad del motor de la persiana",
            "fields": {
                "speed": {
                    "name": "Velocidad",
                    "description": "Velocidad objetivo para el motor de la persiana"
                }
            }
        },
        "simultaneous_blind_positioning": {
            "name": "Posicionamiento simultáneo de persianas",
            "description": "Establece la posición de varias persianas simultáneamente. Se deben seleccionar varias entidades para que esta acción funcione. Esta acción solo debe usarse si desea que las persianas se muevan al mismo tiempo.",
            "fields": {
                "position": {
                    "name": "Posición",
                    "description": "Posición objetivo entre 0.0 (cerrado) y 100.0 (abierto) con una precisión de 1 punto decimal)"
                },
                "entity_ids": {
                    "name": "Persianas",
                    "description": "Las persianas a controlar."
                }
            }
        }
    }
}
