{
    "config": {
        "step": {
            "user": {
                "title": "Aggiungi la tua tenda intelligente Tuiss.",
                "description": "Assicurati di esserti collegato all'app Tuiss prima dell'uso per impostare correttamente i valori superiore e inferiore. L'indirizzo MAC si trova sull'etichetta allegata alla tua tenda o su un'etichetta stampata nella parte superiore della tenda, vicino a dove è collegata la batteria.",
                "data": {
                    "host": "XX:XX:XX:XX:XX:XX",
                    "name": "Nome amichevole per la tua tenda."
                }
            },
            "confirm": {
                "title": "Dai un nome alla tua tenda intelligente Tuiss.",
                "description": "Aggiungi un nome amichevole per la tua tenda.",
                "data": {
                    "name": "Nome amichevole per la tua tenda."
                }
            }
        },
        "error": {
            "cannot_connect": "Connessione fallita. Riprova.",
            "invalid_auth": "Autenticazione fallita. Questo errore non dovrebbe essere possibile, se lo ottieni, segnala un problema.",
            "unknown": "Errore sconosciuto. Riprova. Se ottieni costantemente questo errore, segnala un problema.",
            "device_not_found": "Impossibile trovare il dispositivo. Assicurarsi che sia acceso e nel raggio d'azione.",
            "connection_timeout": "La connessione è scaduta dopo diversi tentativi. Riprova più tardi.",
            "invalid_host": "Il tuo indirizzo MAC deve essere nel formato XX:XX:XX:XX:XX:XX",
            "invalid_name": "Il tuo nome deve contenere più di 0 caratteri"
        },
        "abort": {
            "already_configured": "[%key:common::config_flow::abort::already_configured_device%]",
            "already_configured_by_discovery": "Questo dispositivo è già stato scoperto. Si prega di configurarlo tramite l'elenco dei dispositivi scoperti."
        }
    },
    "options":{
        "step":{
            "init": {
                "title": "Opzioni aggiuntive.",
                "data": {
                    "blind_orientation": "Inverti la risposta di 'Set_Blind_Position'",
                    "blind_restart_position": "Controlla la posizione della tenda al riavvio",
                    "blind_restart_attempts": "Tentativi di riconnessione",
                    "blind_speed": "A che velocità la tenda dovrebbe spostarsi in posizione",
                    "blind_favorite_position": "Posizione Preferita"
                },
                "data_description": {
                    "blind_orientation": "Inverte il risultato dell'azione 'Set_Blind_Position'. Seleziona questa opzione se l'uso dell'azione restituisce un valore opposto a quello che ti aspetteresti, ad es. 60% aperto invece del 40% aperto.",
                    "blind_restart_position": "Recupera la posizione corrente delle tende dopo un riavvio di Home Assistant. Utile se usi l'app Smartview o un telecomando.",
                    "blind_restart_attempts": "Numero di tentativi di connessione che verranno effettuati prima del timeout. Aumenta questo valore se noti che le richieste vengono interrotte. Nota: la distanza tra le tende e i proxy/dongle Bluetooth è la causa principale delle interruzioni di connessione.",
                    "blind_favorite_position": "La posizione (in percentuale, 0=chiuso, 100=aperto) in cui si sposterà la tenda quando viene premuto il pulsante 'Vai alla Posizione Preferita'."
                }
            }
        },
        "error": {
            "blind_is_moving": "La tenda è attualmente in movimento. Attendere che si fermi prima di modificare la velocità."
        }
    }
,
    "services": {
        "get_battery_status": {
            "name": "Ottieni stato batteria",
            "description": "Ottiene lo stato della batteria per le tende Tuiss selezionate"
        },
        "get_blind_position": {
            "name": "Ottieni posizione tenda",
            "description": "Ottiene la posizione corrente della tenda per le tende Tuiss selezionate"
        },
        "set_blind_position": {
            "name": "Imposta posizione tenda",
            "description": "Imposta la posizione della tenda con una precisione di un singolo punto decimale (0,0-100,0)",
            "fields": {
                "position": {
                    "name": "Posizione",
                    "description": "Posizione di destinazione tra 0,0 (chiuso) e 100,0 (aperto) con una precisione di 1 punto decimale)"
                }
            }
        },
        "set_blind_speed": {
            "name": "Imposta velocità tenda",
            "description": "Imposta la velocità del motore della tenda",
            "fields": {
                "speed": {
                    "name": "Velocità",
                    "description": "Velocità di destinazione per il motore della tenda"
                }
            }
        },
        "simultaneous_blind_positioning": {
            "name": "Posizionamento simultaneo delle tende",
            "description": "Imposta la posizione di più tende contemporaneamente. Per questa azione è necessario selezionare più entità. Questa azione dovrebbe essere utilizzata solo se si desidera che le tende si muovano contemporaneamente e si dispone di un numero sufficiente di dispositivi BT per gestire il numero di connessioni che si desidera effettuare (ad esempio, 3 connessioni per proxy esphome).",
            "fields": {
                "position": {
                    "name": "Posizione",
                    "description": "Posizione di destinazione tra 0,0 (chiuso) e 100,0 (aperto) con una precisione di 1 punto decimale)"
                },
                "entity_ids": {
                    "name": "Tende",
                    "description": "Le tende da controllare."
                }
            }
        }
    }

    ,
    "exceptions": {
        "failed_to_open": {
            "message": "{name} non è riuscito ad aprirsi: {error}"
        },
        "failed_to_close": {
            "message": "{name} non è riuscito a chiudersi: {error}"
        },
        "failed_set_position": {
            "message": "{name} non è riuscito a impostare la posizione: {error}"
        },
        "failed_to_stop": {
            "message": "{name} non è riuscito a fermarsi: {error}"
        },
        "device_locked": {
            "message": "{name} è occupato (bloccato). Attendere il completamento dell'operazione corrente."
        }
    }
}
